namespace Ets.SingleApi.Model.Controller
{
    public class BaiFuBaoPaymentRequst : ApiRequst
    {
        /// <summary>
        /// 设置或取得 订单类型
        /// </summary>
        /// <value>
        /// 订单类型
        /// </value>
        /// 创建者：王巍
        /// 创建日期：2/14/2014 9:56 AM
        /// 修改者：
        /// 修改时间：
        /// ----------------------------------------------------------------------------------------
        public int OrderType { get; set; }
        /// <summary>
        /// 设置或获取 订单号
        /// </summary>
        /// <value>
        /// The OrderId
        /// </value>
        /// 创建者：王巍
        /// 创建日期：2/14/2014 9:10 AM
        /// 修改者：
        /// 修改时间：
        /// ----------------------------------------------------------------------------------------
        public int OrderId { get; set; }
        /// <summary>
        /// 设置或获取 商品名称
        /// </summary>
        /// <value>
        /// 商品名称
        /// </value>
        /// 创建者：王巍
        /// 创建日期：2/14/2014 9:10 AM
        /// 修改者：
        /// 修改时间：
        /// ----------------------------------------------------------------------------------------
        public string GoodsName { get; set; }
        /// <summary>
        /// 设置或获取 金额
        /// </summary>
        /// <value>
        /// 金额
        /// </value>
        /// 创建者：王巍
        /// 创建日期：2/14/2014 9:14 AM
        /// 修改者：
        /// 修改时间：
        /// ----------------------------------------------------------------------------------------
        public decimal Amount { get; set; }
        /// <summary>
        /// 设置或获取 百付宝前台通知Url地址
        /// </summary>
        /// <value>
        /// 百付宝后前通知Url地址
        /// </value>
        /// 创建者：王巍
        /// 创建日期：2/14/2014 9:11 AM
        /// 修改者：
        /// 修改时间：
        /// ----------------------------------------------------------------------------------------
        public string PageUrl { get; set; }
        /// <summary>
        /// 设置或获取 百付宝后台通知Url地址
        /// </summary>
        /// <value>
        /// 百付宝后台通知Url地址
        /// </value>
        /// 创建者：王巍
        /// 创建日期：2/14/2014 9:11 AM
        /// 修改者：
        /// 修改时间：
        /// ----------------------------------------------------------------------------------------
        public string ReturnUrl { get; set; }
        /// <summary>
        /// Gets or sets the UserId of BaiFuBaoPaymentRequst
        /// </summary>
        /// <value>
        /// The UserId
        /// </value>
        /// 创建者：王巍
        /// 创建日期：2/14/2014 10:14 AM
        /// 修改者：
        /// 修改时间：
        /// ----------------------------------------------------------------------------------------
        public int UserId { get; set; }
    }
}
