namespace Ets.SingleApi.Model.Controller
{
    /// <summary>
    /// 类名称：DirectPayDetail
    /// 命名空间：Ets.SingleApi.Model.Controller
    /// 类功能：当面付订单详情
    /// </summary>
    /// 创建者：王巍
    /// 创建日期：4/30/2014 5:34 PM
    /// 修改者：
    /// 修改时间：
    /// ----------------------------------------------------------------------------------------
    public class DirectPayDetail
    {
        /// <summary>
        /// 餐厅Id
        /// </summary>
        /// <value>
        /// The SupplierId
        /// </value>
        /// 创建者：王巍
        /// 创建日期：4/30/2014 5:42 PM
        /// 修改者：
        /// 修改时间：
        /// ----------------------------------------------------------------------------------------
        public int SupplierId { get; set; }

        /// <summary>
        /// 餐厅名称
        /// </summary>
        /// <value>
        /// The name of the supplier.
        /// </value>
        /// 创建者：王巍
        /// 创建日期：4/30/2014 5:42 PM
        /// 修改者：
        /// 修改时间：
        /// ----------------------------------------------------------------------------------------
        public string SupplierName { get; set; }

        /// <summary>
        /// 手机号
        /// </summary>
        /// <value>
        /// The Telephone
        /// </value>
        /// 创建者：王巍
        /// 创建日期：4/30/2014 5:41 PM
        /// 修改者：
        /// 修改时间：
        /// ----------------------------------------------------------------------------------------
        public string Telephone { get; set; }

        /// <summary>
        /// 支付方式Id
        /// </summary>
        /// <value>
        /// 支付方式Id
        /// </value>
        /// 创建者：王巍
        /// 创建日期：4/30/2014 5:41 PM
        /// 修改者：
        /// 修改时间：
        /// ----------------------------------------------------------------------------------------
        public int PaymentMethodId { get; set; }

        /// <summary>
        /// 是否支付
        /// </summary>
        /// <value>
        /// 是否支付
        /// </value>
        /// 创建者：王巍
        /// 创建日期：4/30/2014 10:37 AM
        /// 修改者：
        /// 修改时间：
        /// ----------------------------------------------------------------------------------------
        public bool IsPaid { get; set; }

        /// <summary>
        /// 创建日期
        /// </summary>
        /// <value>
        /// 创建日期
        /// </value>
        /// 创建者：王巍
        /// 创建日期：4/30/2014 5:41 PM
        /// 修改者：
        /// 修改时间：
        /// ----------------------------------------------------------------------------------------
        public string CeateDate { get; set; }
    }
}