namespace Ets.SingleApi.Model.Controller
{
    /// <summary>
    /// 类名称：EtsWapDingTaiShoppingCartOrderRequst
    /// 命名空间：Ets.SingleApi.Model.Controller
    /// 类功能：保存订单信息参数
    /// </summary>
    /// 创建者：周超
    /// 创建日期：10/23/2013 10:28 AM
    /// 修改者：
    /// 修改时间：
    /// ----------------------------------------------------------------------------------------
    public class EtsWapDingTaiShoppingCartOrderRequst : ApiRequst
    {
        /// <summary>
        /// 设置或取得订单唯一标识符
        /// </summary>
        /// <value>
        /// 订单唯一标识符
        /// </value>
        /// 创建者：周超
        /// 创建日期：10/22/2013 5:46 PM
        /// 修改者：
        /// 修改时间：
        /// ----------------------------------------------------------------------------------------
        public string Id { get; set; }

        /// <summary>
        /// 设置或取得订单备注信息
        /// </summary>
        /// <value>
        /// 订单备注信息
        /// </value>
        /// 创建者：周超
        /// 创建日期：10/22/2013 10:02 PM
        /// 修改者：
        /// 修改时间：
        /// ----------------------------------------------------------------------------------------
        public string OrderInstruction { get; set; }

        /// <summary>
        /// 设置或取得就餐方式
        /// </summary>
        /// <value>
        /// 就餐方式
        /// </value>
        /// 创建者：周超
        /// 创建日期：10/22/2013 5:46 PM
        /// 修改者：
        /// 修改时间：
        /// ----------------------------------------------------------------------------------------
        public int DinnerMethodId { get; set; }

        /// <summary>
        /// 设置或取得就餐人数
        /// </summary>
        /// <value>
        /// 就餐人数
        /// </value>
        /// 创建者：周超
        /// 创建日期：10/22/2013 5:46 PM
        /// 修改者：
        /// 修改时间：
        /// ----------------------------------------------------------------------------------------
        public int DinnerNumber { get; set; }

        /// <summary>
        /// 设置或取得座位号
        /// </summary>
        /// <value>
        /// 座位号
        /// </value>
        /// 创建者：周超
        /// 创建日期：10/22/2013 5:46 PM
        /// 修改者：
        /// 修改时间：
        /// ----------------------------------------------------------------------------------------
        public string SeatNumber { get; set; }

        /// <summary>
        /// 设置或取得排队号
        /// </summary>
        /// <value>
        /// 排队号
        /// </value>
        /// 创建者：周超
        /// 创建日期：10/22/2013 5:46 PM
        /// 修改者：
        /// 修改时间：
        /// ----------------------------------------------------------------------------------------
        public string LineNumber { get; set; }

        /// <summary>
        /// 设置或取得订单模板信息
        /// </summary>
        /// <value>
        /// 订单模板信息
        /// </value>
        /// 创建者：周超
        /// 创建日期：10/22/2013 10:05 PM
        /// 修改者：
        /// 修改时间：
        /// ----------------------------------------------------------------------------------------
        public string Template { get; set; }

        /// <summary>
        /// 设置或取得订单路径信息
        /// </summary>
        /// <value>
        /// 订单路径信息
        /// </value>
        /// 创建者：周超
        /// 创建日期：11/9/2013 10:40 AM
        /// 修改者：
        /// 修改时间：
        /// ----------------------------------------------------------------------------------------
        public string Path { get; set; }

        /// <summary>
        /// 设置或取得是否开发票
        /// </summary>
        /// <value>
        /// 是否开发票
        /// </value>
        /// 创建者：周超
        /// 创建日期：11/9/2013 10:39 AM
        /// 修改者：
        /// 修改时间：
        /// ----------------------------------------------------------------------------------------
        public bool InvoiceRequired { get; set; }

        /// <summary>
        /// 设置或取得发票标题
        /// </summary>
        /// <value>
        /// 发票标题
        /// </value>
        /// 创建者：周超
        /// 创建日期：11/9/2013 10:40 AM
        /// 修改者：
        /// 修改时间：
        /// ----------------------------------------------------------------------------------------
        public string InvoiceTitle { get; set; }

        /// <summary>
        /// 设置或取得发票类型
        /// </summary>
        /// <value>
        /// 发票类型 0 个人  1 公司
        /// </value>
        /// 创建者：周超
        /// 创建日期：11/9/2013 10:39 AM
        /// 修改者：
        /// 修改时间：
        /// ----------------------------------------------------------------------------------------
        public string InvoiceType { get; set; }

        /// <summary>
        /// 设置或取得订单说明
        /// </summary>
        /// <value>
        /// 订单说明
        /// </value>
        /// 创建者：周超
        /// 创建日期：11/9/2013 10:40 AM
        /// 修改者：
        /// 修改时间：
        /// ----------------------------------------------------------------------------------------
        public string OrderNotes { get; set; }

        /// <summary>
        /// 设置或取得订单所属区域Id
        /// </summary>
        /// <value>
        /// 订单所属区域Id
        /// </value>
        /// 创建者：周超
        /// 创建日期：11/9/2013 10:40 AM
        /// 修改者：
        /// 修改时间：
        /// ----------------------------------------------------------------------------------------
        public int? AreaId { get; set; }

        /// <summary>
        /// 设置或取得是否开发票
        /// </summary>
        /// <value>
        /// 是否开发票
        /// </value>
        /// 创建者：周超
        /// 创建日期：11/9/2013 10:39 AM
        /// 修改者：
        /// 修改时间：
        /// ----------------------------------------------------------------------------------------
        public bool IsTakeInvoice { get; set; }

        /// <summary>
        /// 设置或取得支付方式
        /// </summary>
        /// <value>
        /// 支付方式
        /// </value>
        /// 创建者：周超
        /// 创建日期：10/23/2013 5:49 PM
        /// 修改者：
        /// 修改时间：
        /// ----------------------------------------------------------------------------------------
        public int PaymentMethodId { get; set; }

        /// <summary>
        /// 设置或取得订单优惠码
        /// </summary>
        /// <value>
        /// 订单优惠码
        /// </value>
        /// 创建者：周超
        /// 创建日期：10/23/2013 5:49 PM
        /// 修改者：
        /// 修改时间：
        /// ----------------------------------------------------------------------------------------
        public string CouponCode { get; set; }
    }
}