namespace Ets.SingleApi.Model.Controller
{
    using System;

    /// <summary>
    /// 类名称：HaiDiLaoShoppingCartOrderRequst
    /// 命名空间：Ets.SingleApi.Model.Controller
    /// 类功能：保存订单信息参数
    /// </summary>
    /// 创建者：周超
    /// 创建日期：10/23/2013 10:28 AM
    /// 修改者：
    /// 修改时间：
    /// ----------------------------------------------------------------------------------------
    public class HaiDiLaoShoppingCartOrderRequst : ApiRequst
    {
        /// <summary>
        /// 设置或取得订单唯一标识符
        /// </summary>
        /// <value>
        /// 订单唯一标识符
        /// </value>
        /// 创建者：周超
        /// 创建日期：10/22/2013 5:46 PM
        /// 修改者：
        /// 修改时间：
        /// ----------------------------------------------------------------------------------------
        public string Id { get; set; }

        /// <summary>
        /// 设置或取得取餐方式
        /// </summary>
        /// <value>
        /// 取餐方式
        /// </value>
        /// 创建者：周超
        /// 创建日期：10/22/2013 5:46 PM
        /// 修改者：
        /// 修改时间：
        /// ----------------------------------------------------------------------------------------
        public int? DeliveryMethodId { get; set; }

        /// <summary>
        /// 设置或取得订单备注信息
        /// </summary>
        /// <value>
        /// 订单备注信息
        /// </value>
        /// 创建者：周超
        /// 创建日期：10/22/2013 10:02 PM
        /// 修改者：
        /// 修改时间：
        /// ----------------------------------------------------------------------------------------
        public string DeliveryInstruction { get; set; }

        /// <summary>
        /// 设置或取得订单模板信息
        /// </summary>
        /// <value>
        /// 订单模板信息
        /// </value>
        /// 创建者：周超
        /// 创建日期：10/22/2013 10:05 PM
        /// 修改者：
        /// 修改时间：
        /// ----------------------------------------------------------------------------------------
        public string Template { get; set; }

        /// <summary>
        /// 设置或取得订单路径信息
        /// </summary>
        /// <value>
        /// 订单路径信息
        /// </value>
        /// 创建者：周超
        /// 创建日期：11/9/2013 10:40 AM
        /// 修改者：
        /// 修改时间：
        /// ----------------------------------------------------------------------------------------
        public string Path { get; set; }

        /// <summary>
        /// 设置或取得是否开发票
        /// </summary>
        /// <value>
        /// 是否开发票
        /// </value>
        /// 创建者：周超
        /// 创建日期：11/9/2013 10:39 AM
        /// 修改者：
        /// 修改时间：
        /// ----------------------------------------------------------------------------------------
        public bool InvoiceRequired { get; set; }

        /// <summary>
        /// 设置或取得发票标题
        /// </summary>
        /// <value>
        /// 发票标题
        /// </value>
        /// 创建者：周超
        /// 创建日期：11/9/2013 10:40 AM
        /// 修改者：
        /// 修改时间：
        /// ----------------------------------------------------------------------------------------
        public string InvoiceTitle { get; set; }

        /// <summary>
        /// 设置或取得发票类型
        /// </summary>
        /// <value>
        /// 发票类型 0 个人  1 公司
        /// </value>
        /// 创建者：周超
        /// 创建日期：11/9/2013 10:39 AM
        /// 修改者：
        /// 修改时间：
        /// ----------------------------------------------------------------------------------------
        public string InvoiceType { get; set; }

        /// <summary>
        /// 设置或取得订单说明
        /// </summary>
        /// <value>
        /// 订单说明
        /// </value>
        /// 创建者：周超
        /// 创建日期：11/9/2013 10:40 AM
        /// 修改者：
        /// 修改时间：
        /// ----------------------------------------------------------------------------------------
        public string OrderNotes { get; set; }

        /// <summary>
        /// 设置或取得订单所属区域Id
        /// </summary>
        /// <value>
        /// 订单所属区域Id
        /// </value>
        /// 创建者：周超
        /// 创建日期：11/9/2013 10:40 AM
        /// 修改者：
        /// 修改时间：
        /// ----------------------------------------------------------------------------------------
        public int? AreaId { get; set; }

        /// <summary>
        /// 设置或取得是否开发票
        /// </summary>
        /// <value>
        /// 是否开发票
        /// </value>
        /// 创建者：周超
        /// 创建日期：11/9/2013 10:39 AM
        /// 修改者：
        /// 修改时间：
        /// ----------------------------------------------------------------------------------------
        public bool IsTakeInvoice { get; set; }

        /// <summary>
        /// 设置或取得是送餐日期
        /// </summary>
        /// <value>
        /// 送餐日期
        /// </value>
        /// 创建者：周超
        /// 创建日期：11/9/2013 10:39 AM
        /// 修改者：
        /// 修改时间：
        /// ----------------------------------------------------------------------------------------
        public DateTime? DeliveryDate { get; set; }

        /// <summary>
        /// 设置或取得是送餐时间
        /// </summary>
        /// <value>
        /// 送餐时间
        /// </value>
        /// 创建者：周超
        /// 创建日期：11/9/2013 10:39 AM
        /// 修改者：
        /// 修改时间：
        /// ----------------------------------------------------------------------------------------
        public string DeliveryTime { get; set; }

        /// <summary>
        /// 设置或取得是送餐时间类型
        /// </summary>
        /// <value>
        /// 送餐时间类型
        /// </value>
        /// 创建者：周超
        /// 创建日期：11/9/2013 10:39 AM
        /// 修改者：
        /// 修改时间：
        /// ----------------------------------------------------------------------------------------
        public int DeliveryType { get; set; }

        /// <summary>
        /// 设置或取得支付方式
        /// </summary>
        /// <value>
        /// 支付方式
        /// </value>
        /// 创建者：周超
        /// 创建日期：10/23/2013 5:49 PM
        /// 修改者：
        /// 修改时间：
        /// ----------------------------------------------------------------------------------------
        public int PaymentMethodId { get; set; }
    }
}