namespace Ets.SingleApi.Model.Controller
{
    using System.Collections.Generic;

    /// <summary>
    /// 类名称：LightSupplier
    /// 命名空间：Ets.SingleApi.Model.Controller
    /// 类功能：轻应用餐厅或集团数据
    /// </summary>
    /// 创建者：周超
    /// 创建日期：12/20/2013 11:43 AM
    /// 修改者：
    /// 修改时间：
    /// ----------------------------------------------------------------------------------------
    public class LightSupplier
    {
        /// <summary>
        /// 设置或取得轻应用餐厅或集团唯一标识
        /// </summary>
        /// <value>
        /// 轻应用餐厅或集团唯一标识
        /// </value>
        /// 创建者：周超
        /// 创建日期：12/20/2013 12:00 PM
        /// 修改者：
        /// 修改时间：
        /// ----------------------------------------------------------------------------------------
        public int SupplierGroupLightId { get; set; }

        /// <summary>
        /// 设置或取得轻应用唯一标识
        /// </summary>
        /// <value>
        /// 轻应用唯一标识
        /// </value>
        /// 创建者：周超
        /// 创建日期：12/20/2013 12:00 PM
        /// 修改者：
        /// 修改时间：
        /// ----------------------------------------------------------------------------------------
        public int LightApplicationId { get; set; }

        /// <summary>
        /// 设置或取得集团或餐厅logo
        /// </summary>
        /// <value>
        /// 集团或餐厅logo
        /// </value>
        /// 创建者：周超
        /// 创建日期：12/20/2013 12:01 PM
        /// 修改者：
        /// 修改时间：
        /// ----------------------------------------------------------------------------------------
        public string LogoUrl { get; set; }

        /// <summary>
        /// 设置或取得集团或餐厅名称
        /// </summary>
        /// <value>
        /// 集团或餐厅名称
        /// </value>
        /// 创建者：周超
        /// 创建日期：12/20/2013 12:02 PM
        /// 修改者：
        /// 修改时间：
        /// ----------------------------------------------------------------------------------------
        public string Name { get; set; }

        /// <summary>
        /// 设置或取得集团或餐厅广告宣传图列表
        /// </summary>
        /// <value>
        /// 集团或餐厅广告宣传图列表
        /// </value>
        /// 创建者：周超
        /// 创建日期：12/20/2013 12:02 PM
        /// 修改者：
        /// 修改时间：
        /// ----------------------------------------------------------------------------------------
        public List<string> AdvertisementUrlList { get; set; }

        /// <summary>
        /// 设置或取得集团或餐厅开通的功能列表
        /// </summary>
        /// <value>
        /// 集团或餐厅开通的功能列表
        /// </value>
        /// 创建者：周超
        /// 创建日期：12/20/2013 12:03 PM
        /// 修改者：
        /// 修改时间：
        /// ----------------------------------------------------------------------------------------
        public List<LightFeature> LightFeatureList { get; set; }
    }
}
