namespace Ets.SingleApi.Model.Controller
{
    /// <summary>
    /// 类名称：LocationCity
    /// 命名空间：Ets.SingleApi.Model.Controller
    /// 类功能：定位信息
    /// </summary>
    /// 创建者：周超
    /// 创建日期：1/8/2014 12:08 PM
    /// 修改者：
    /// 修改时间：
    /// ----------------------------------------------------------------------------------------
    public class LocationCity
    {
        /// <summary>
        /// 设置或取得城市编号
        /// </summary>
        /// <value>
        /// 城市编号
        /// </value>
        /// 创建者：周超
        /// 创建日期：1/8/2014 12:06 PM
        /// 修改者：
        /// 修改时间：
        /// ----------------------------------------------------------------------------------------
        public string CityCode { get; set; }

        /// <summary>
        /// 设置或取得城市
        /// </summary>
        /// <value>
        /// 城市
        /// </value>
        /// 创建者：周超
        /// 创建日期：1/8/2014 12:06 PM
        /// 修改者：
        /// 修改时间：
        /// ----------------------------------------------------------------------------------------
        public string CityName { get; set; }

        /// <summary>
        /// 设置或取得详细地址
        /// </summary>
        /// <value>
        /// 详细地址
        /// </value>
        /// 创建者：周超
        /// 创建日期：1/8/2014 12:06 PM
        /// 修改者：
        /// 修改时间：
        /// ----------------------------------------------------------------------------------------
        public string Address { get; set; }
    }
}
