namespace Ets.SingleApi.Model.Controller
{
    /// <summary>
    /// 类名称：SaveQueueRequst
    /// 命名空间：Ets.SingleApi.Model.Controller
    /// 类功能：保存排队信息参数
    /// </summary>
    /// 创建者：周超
    /// 创建日期：11/12/2013 10:06 AM
    /// 修改者：
    /// 修改时间：
    /// ----------------------------------------------------------------------------------------
    public class SaveQueueRequst : ApiRequst
    {
        /// <summary>
        /// 台位类型信息Id
        /// </summary>
        /// <value>
        /// 台位类型信息Id
        /// </value>
        /// 创建者：周超
        /// 创建日期：11/12/2013 10:07 AM
        /// 修改者：
        /// 修改时间：
        /// ----------------------------------------------------------------------------------------
        public int DeskTypeId { get; set; }

        /// <summary>
        /// 排队描述
        /// </summary>
        /// <value>
        /// 排队描述
        /// </value>
        /// 创建者：周超
        /// 创建日期：11/12/2013 10:07 AM
        /// 修改者：
        /// 修改时间：
        /// ----------------------------------------------------------------------------------------
        public string Description { get; set; }

        /// <summary>
        /// 用户姓名
        /// </summary>
        /// <value>
        /// 用户姓名
        /// </value>
        /// 创建者：周超
        /// 创建日期：11/12/2013 10:07 AM
        /// 修改者：
        /// 修改时间：
        /// ----------------------------------------------------------------------------------------
        public string UserName { get; set; }

        /// <summary>
        /// 用户电话
        /// </summary>
        /// <value>
        /// 用户电话
        /// </value>
        /// 创建者：周超
        /// 创建日期：12/29/2013 10:50 AM
        /// 修改者：
        /// 修改时间：
        /// ----------------------------------------------------------------------------------------
        public string Telephone { get; set; }

        /// <summary>
        /// 性别
        /// </summary>
        /// <value>
        /// 性别
        /// </value>
        /// 创建者：周超
        /// 创建日期：12/29/2013 10:50 AM
        /// 修改者：
        /// 修改时间：
        /// ----------------------------------------------------------------------------------------
        public int Gender { get; set; }

        /// <summary>
        /// 人数
        /// </summary>
        /// <value>
        /// 人数
        /// </value>
        /// 创建者：周超
        /// 创建日期：1/16/2014 9:22 AM
        /// 修改者：
        /// 修改时间：
        /// ----------------------------------------------------------------------------------------
        public int SeatNumber { get; set; }

        /// <summary>
        /// 用户Id
        /// </summary>
        /// <value>
        /// 用户Id
        /// </value>
        /// 创建者：周超
        /// 创建日期：3/21/2014 5:36 PM
        /// 修改者：
        /// 修改时间：
        /// ----------------------------------------------------------------------------------------
        public int UserId { get; set; }
    }
}