namespace Ets.SingleApi.Model.Controller
{
    /// <summary>
    /// 类名称：SupplierCoupon
    /// 命名空间：Ets.SingleApi.Model.Controller
    /// 类功能：折扣实体
    /// </summary>
    /// 创建者：周超
    /// 创建日期：12/7/2013 12:45 PM
    /// 修改者：
    /// 修改时间：
    /// ----------------------------------------------------------------------------------------
    public class SupplierCoupon
    {
        /// <summary>
        /// 设置或取得折扣Id
        /// </summary>
        /// <value>
        /// 折扣Id
        /// </value>
        /// 创建者：周超
        /// 创建日期：12/7/2013 12:46 PM
        /// 修改者：
        /// 修改时间：
        /// ----------------------------------------------------------------------------------------
        public int SupplierCouponId { get; set; }

        /// <summary>
        /// 设置或取得折扣率
        /// </summary>
        /// <value>
        /// 折扣率
        /// </value>
        /// 创建者：周超
        /// 创建日期：12/7/2013 12:46 PM
        /// 修改者：
        /// 修改时间：
        /// ----------------------------------------------------------------------------------------
        public decimal Discount { get; set; }

        /// <summary>
        /// 设置或取得折扣描述
        /// </summary>
        /// <value>
        /// 折扣描述
        /// </value>
        /// 创建者：周超
        /// 创建日期：12/7/2013 12:46 PM
        /// 修改者：
        /// 修改时间：
        /// ----------------------------------------------------------------------------------------
        public string Description { get; set; }

        /// <summary>
        /// 设置或取得打折类型Id
        /// </summary>
        /// <value>
        /// 打折类型Id
        /// </value>
        /// 创建者：周超
        /// 创建日期：12/9/2013 9:06 AM
        /// 修改者：
        /// 修改时间：
        /// ----------------------------------------------------------------------------------------
        public int CouponTypeId { get; set; }
    }
}