
namespace Ets.SingleApi.Model.Controller
{
    /// <summary>
    /// 类名称：WechatPaymentNotifyRequest
    /// 命名空间：Ets.SingleApi.Model.Controller
    /// 类功能：微信支付回调通知url参数
    /// </summary>
    /// 创建者：孟祺宙 
    /// 创建日期：2014/8/7 11:25
    /// 修改者：
    /// 修改时间：
    /// ----------------------------------------------------------------------------------------
    public class WechatPaymentNotifyRequest
    {
        /// <summary>
        /// 签名方式
        /// </summary>
        /// <value>
        /// The sign_type
        /// </value>
        /// 创建者：孟祺宙 
        /// 创建日期：2014/8/7 12:00
        /// 修改者：
        /// 修改时间：
        /// ----------------------------------------------------------------------------------------
        public string sign_type { get; set; }

        /// <summary>
        /// 字符集
        /// </summary>
        /// <value>
        /// The input_charset
        /// </value>
        /// 创建者：孟祺宙 
        /// 创建日期：2014/8/7 13:25
        /// 修改者：
        /// 修改时间：
        /// ----------------------------------------------------------------------------------------
        public string input_charset { get; set; }

        /// <summary>
        /// 签名
        /// </summary>
        /// <value>
        /// The sign
        /// </value>
        /// 创建者：孟祺宙 
        /// 创建日期：2014/8/7 13:26
        /// 修改者：
        /// 修改时间：
        /// ----------------------------------------------------------------------------------------
        public string sign { get; set; }

        /// <summary>
        /// 交易模式
        /// </summary>
        /// <value>
        /// The trade_mode
        /// </value>
        /// 创建者：孟祺宙 
        /// 创建日期：2014/8/7 13:26
        /// 修改者：
        /// 修改时间：
        /// ----------------------------------------------------------------------------------------
        public int trade_mode { get; set; }

        /// <summary>
        /// 交易状态
        /// </summary>
        /// <value>
        /// The trade_state
        /// </value>
        /// 创建者：孟祺宙 
        /// 创建日期：2014/8/7 13:27
        /// 修改者：
        /// 修改时间：
        /// ----------------------------------------------------------------------------------------
        public int trade_state { get; set; }

        /// <summary>
        /// 商户号
        /// </summary>
        /// <value>
        /// The partner
        /// </value>
        /// 创建者：孟祺宙 
        /// 创建日期：2014/8/7 13:28
        /// 修改者：
        /// 修改时间：
        /// ----------------------------------------------------------------------------------------
        public string partner { get; set; }

        /// <summary>
        /// 付款银行
        /// </summary>
        /// <value>
        /// The bank_type
        /// </value>
        /// 创建者：孟祺宙 
        /// 创建日期：2014/8/7 13:29
        /// 修改者：
        /// 修改时间：
        /// ----------------------------------------------------------------------------------------
        public string bank_type { get; set; }

        /// <summary>
        /// Gets or sets the bank_billno of WechatPaymentNotifyRequest
        /// </summary>
        /// <value>
        /// The bank_billno
        /// </value>
        /// 创建者：孟祺宙 
        /// 创建日期：2014/8/7 13:29
        /// 修改者：
        /// 修改时间：
        /// ----------------------------------------------------------------------------------------
        public string bank_billno { get; set; }

        /// <summary>
        /// 总金额
        /// </summary>
        /// <value>
        /// The total_fee
        /// </value>
        /// 创建者：孟祺宙 
        /// 创建日期：2014/8/7 13:29
        /// 修改者：
        /// 修改时间：
        /// ----------------------------------------------------------------------------------------
        public int total_fee { get; set; }

        /// <summary>
        /// 币种
        /// </summary>
        /// <value>
        /// The fee_type
        /// </value>
        /// 创建者：孟祺宙 
        /// 创建日期：2014/8/7 13:30
        /// 修改者：
        /// 修改时间：
        /// ----------------------------------------------------------------------------------------
        public int fee_type { get; set; }

        /// <summary>
        /// 通知 ID
        /// </summary>
        /// <value>
        /// The notify_id
        /// </value>
        /// 创建者：孟祺宙 
        /// 创建日期：2014/8/7 13:30
        /// 修改者：
        /// 修改时间：
        /// ----------------------------------------------------------------------------------------
        public string notify_id { get; set; }

        /// <summary>
        /// 订单号
        /// </summary>
        /// <value>
        /// The transaction_id
        /// </value>
        /// 创建者：孟祺宙 
        /// 创建日期：2014/8/7 13:30
        /// 修改者：
        /// 修改时间：
        /// ----------------------------------------------------------------------------------------
        public string transaction_id { get; set; }

        /// <summary>
        /// 商户订单号
        /// </summary>
        /// <value>
        /// The out_trade_no
        /// </value>
        /// 创建者：孟祺宙 
        /// 创建日期：2014/8/7 13:31
        /// 修改者：
        /// 修改时间：
        /// ----------------------------------------------------------------------------------------
        public string out_trade_no { get; set; }

        /// <summary>
        /// 商户数据包
        /// </summary>
        /// <value>
        /// The attach
        /// </value>
        /// 创建者：孟祺宙 
        /// 创建日期：2014/8/7 13:31
        /// 修改者：
        /// 修改时间：
        /// ----------------------------------------------------------------------------------------
        public string attach { get; set; }

        /// <summary>
        /// 支付完成时间
        /// </summary>
        /// <value>
        /// The time_end
        /// </value>
        /// 创建者：孟祺宙 
        /// 创建日期：2014/8/7 13:31
        /// 修改者：
        /// 修改时间：
        /// ----------------------------------------------------------------------------------------
        public string time_end { get; set; }

        /// <summary>
        /// 物流费用
        /// </summary>
        /// <value>
        /// The transport_fee
        /// </value>
        /// 创建者：孟祺宙 
        /// 创建日期：2014/8/7 13:32
        /// 修改者：
        /// 修改时间：
        /// ----------------------------------------------------------------------------------------
        public int transport_fee { get; set; }

        /// <summary>
        /// 物品费用
        /// </summary>
        /// <value>
        /// The product_fee
        /// </value>
        /// 创建者：孟祺宙 
        /// 创建日期：2014/8/7 13:33
        /// 修改者：
        /// 修改时间：
        /// ----------------------------------------------------------------------------------------
        public int product_fee { get; set; }

        /// <summary>
        /// 折扣价格
        /// </summary>
        /// <value>
        /// The discount
        /// </value>
        /// 创建者：孟祺宙 
        /// 创建日期：2014/8/7 13:36
        /// 修改者：
        /// 修改时间：
        /// ----------------------------------------------------------------------------------------
        public int discount { get; set; }
    }
}
