namespace Ets.SingleApi.Model.Services
{
    using System.Collections.Generic;

    /// <summary>
    /// 类名称：WaiMaiOrderDetailModel
    /// 命名空间：Ets.SingleApi.Model.Services
    /// 类功能：订台订单
    /// </summary>
    /// 创建者：周超
    /// 创建日期：2013/10/20 15:44
    /// 修改者：
    /// 修改时间：
    /// ----------------------------------------------------------------------------------------
    public class DingTaiOrderDetailModel : IOrderDetailModel
    {
        /// <summary>
        /// 设置或取得订单号
        /// </summary>
        /// <value>
        /// 订单号
        /// </value>
        /// 创建者：周超
        /// 创建日期：2013/10/20 15:44
        /// 修改者：
        /// 修改时间：
        /// ----------------------------------------------------------------------------------------
        public int OrderId { get; set; }

        /// <summary>
        /// 设置或取得订单类型
        /// </summary>
        /// <value>
        /// 订单类型
        /// </value>
        /// 创建者：周超
        /// 创建日期：2013/10/20 15:45
        /// 修改者：
        /// 修改时间：
        /// ----------------------------------------------------------------------------------------
        public int? OrderTypeId { get; set; }

        /// <summary>
        /// Gets or sets the OrderStatus of WaiMaiOrderModel
        /// </summary>
        /// <value>
        /// The OrderStatus
        /// </value>
        /// 创建者：周超
        /// 创建日期：2013/10/20 22:35
        /// 修改者：
        /// 修改时间：
        /// ----------------------------------------------------------------------------------------
        public int? OrderStatusId { get; set; }

        /// <summary>
        /// 设置或取得下单时间
        /// </summary>
        /// <value>
        /// 下单时间
        /// </value>
        /// 创建者：周超
        /// 创建日期：2013/10/20 15:44
        /// 修改者：
        /// 修改时间：
        /// ----------------------------------------------------------------------------------------
        public string DateReserved { get; set; }

        /// <summary>
        /// 设置或取得订单备注
        /// </summary>
        /// <value>
        /// 订单备注
        /// </value>
        /// 创建者：周超
        /// 创建日期：10/23/2013 9:56 PM
        /// 修改者：
        /// 修改时间：
        /// ----------------------------------------------------------------------------------------
        public string Description { get; set; }

        /// <summary>
        /// 设置或取得餐厅集团Id
        /// </summary>
        /// <value>
        /// 餐厅集团Id
        /// </value>
        /// 创建者：周超
        /// 创建日期：2013/10/20 15:44
        /// 修改者：
        /// 修改时间：
        /// ----------------------------------------------------------------------------------------
        public int? SupplierGroupId { get; set; }

        /// <summary>
        /// 购物车Id
        /// </summary>
        /// <value>
        /// The ShoppingCartId
        /// </value>
        /// 创建者：王巍
        /// 创建日期：2/25/2014 9:03 AM
        /// 修改者：
        /// 修改时间：
        /// ----------------------------------------------------------------------------------------
        public string ShoppingCartId { get; set; }

        /// <summary>
        /// 设置或取得餐厅Id
        /// </summary>
        /// <value>
        /// 餐厅Id
        /// </value>
        /// 创建者：周超
        /// 创建日期：2013/10/20 15:44
        /// 修改者：
        /// 修改时间：
        /// ----------------------------------------------------------------------------------------
        public int SupplierId { get; set; }

        /// <summary>
        /// 设置或取得餐厅名称
        /// </summary>
        /// <value>
        /// 餐厅名称
        /// </value>
        /// 创建者：周超
        /// 创建日期：2013/10/20 15:44
        /// 修改者：
        /// 修改时间：
        /// ----------------------------------------------------------------------------------------
        public string SupplierName { get; set; }

        /// <summary>
        /// 设置或取得餐厅电话
        /// </summary>
        /// <value>
        /// 餐厅电话
        /// </value>
        /// 创建者：周超
        /// 创建日期：10/23/2013 9:15 PM
        /// 修改者：
        /// 修改时间：
        /// ----------------------------------------------------------------------------------------
        public string SupplierTelephone { get; set; }

        /// <summary>
        /// 设置或取得餐厅地址
        /// </summary>
        /// <value>
        /// 餐厅地址
        /// </value>
        /// 创建者：周超
        /// 创建日期：10/23/2013 9:15 PM
        /// 修改者：
        /// 修改时间：
        /// ----------------------------------------------------------------------------------------
        public string SupplierAddress { get; set; }

        /// <summary>
        /// 设置或取得餐厅送餐费
        /// </summary>
        /// <value>
        /// 订单送餐费
        /// </value>
        /// 创建者：周超
        /// 创建日期：10/23/2013 5:49 PM
        /// 修改者：
        /// 修改时间：
        /// ----------------------------------------------------------------------------------------
        public string SupplierFixedDeliveryFee { get; set; }

        /// <summary>
        /// 设置或取得餐厅经度
        /// </summary>
        /// <value>
        /// 餐厅经度
        /// </value>
        /// 创建者：周超
        /// 创建日期：11/12/2013 4:01 PM
        /// 修改者：
        /// 修改时间：
        /// ----------------------------------------------------------------------------------------
        public decimal SupplierBaIduLat { get; set; }

        /// <summary>
        /// 设置或取得餐厅纬度
        /// </summary>
        /// <value>
        /// 餐厅纬度
        /// </value>
        /// 创建者：周超
        /// 创建日期：11/12/2013 4:01 PM
        /// 修改者：
        /// 修改时间：
        /// ----------------------------------------------------------------------------------------
        public decimal SupplierBaIduLong { get; set; }

        /// <summary>
        /// 设置或取得客户总消费
        /// </summary>
        /// <value>
        /// 客户总消费
        /// </value>
        /// 创建者：周超
        /// 创建日期：2013/10/20 15:45
        /// 修改者：
        /// 修改时间：
        /// ----------------------------------------------------------------------------------------
        public string CustomerTotal { get; set; }

        /// <summary>
        /// 设置或取得打包费
        /// </summary>
        /// <value>
        /// 打包费
        /// </value>
        /// 创建者：周超
        /// 创建日期：2013/10/20 15:45
        /// 修改者：
        /// 修改时间：
        /// ----------------------------------------------------------------------------------------
        public string PackagingFee { get; set; }

        /// <summary>
        /// 设置或取得送餐费
        /// </summary>
        /// <value>
        /// 送餐费
        /// </value>
        /// 创建者：周超
        /// 创建日期：2013/10/20 15:45
        /// 修改者：
        /// 修改时间：
        /// ----------------------------------------------------------------------------------------
        public string FixedDeliveryFee { get; set; }

        /// <summary>
        /// 设置或取得折扣
        /// </summary>
        /// <value>
        /// 折扣
        /// </value>
        /// 创建者：周超
        /// 创建日期：2013/10/20 15:45
        /// 修改者：
        /// 修改时间：
        /// ----------------------------------------------------------------------------------------
        public string Commission { get; set; }

        /// <summary>
        /// 设置或取得付款方式
        /// </summary>
        /// <value>
        /// 付款方式
        /// </value>
        /// 创建者：周超
        /// 创建日期：11/6/2013 11:15 AM
        /// 修改者：
        /// 修改时间：
        /// ----------------------------------------------------------------------------------------
        public int? RealSupplierType { get; set; }

        /// <summary>
        /// 设置或取得取餐方式
        /// </summary>
        /// <value>
        /// 取餐方式
        /// </value>
        /// 创建者：周超
        /// 创建日期：2013/10/20 15:47
        /// 修改者：
        /// 修改时间：
        /// ----------------------------------------------------------------------------------------
        public int? DeliveryMethodId { get; set; }

        /// <summary>
        /// 设置或取得是否支付
        /// </summary>
        /// <value>
        /// 是否支付
        /// </value>
        /// 创建者：周超
        /// 创建日期：2013/10/20 15:45
        /// 修改者：
        /// 修改时间：
        /// ----------------------------------------------------------------------------------------
        public bool IsPaid { get; set; }

        /// <summary>
        /// 设置或取得是否确认订单
        /// </summary>
        /// <value>
        /// 是否确认订单
        /// </value>
        /// 创建者：周超
        /// 创建日期：2013/10/20 15:45
        /// 修改者：
        /// 修改时间：
        /// ----------------------------------------------------------------------------------------
        public bool IsConfirm { get; set; }

        /// <summary>
        /// 设置或取得支付方式
        /// </summary>
        /// <value>
        /// 支付方式
        /// </value>
        /// 创建者：周超
        /// 创建日期：11/13/2013 5:06 PM
        /// 修改者：
        /// 修改时间：
        /// ----------------------------------------------------------------------------------------
        public int? PaymentMethodId { get; set; }

        /// <summary>
        /// 设置或取得发票信息
        /// </summary>
        /// <value>
        /// 发票信息
        /// </value>
        /// 创建者：周超
        /// 创建日期：11/20/2013 3:39 PM
        /// 修改者：
        /// 修改时间：
        /// ----------------------------------------------------------------------------------------
        public string InvoiceTitle { get; set; }

        /// <summary>
        /// 设置或取得送餐人姓名
        /// </summary>
        /// <value>
        /// 送餐人姓名
        /// </value>
        /// 创建者：周超
        /// 创建日期：11/21/2013 7:19 PM
        /// 修改者：
        /// 修改时间：
        /// ----------------------------------------------------------------------------------------
        public string ContactName { get; set; }

        /// <summary>
        /// 设置或取得送餐人电话
        /// </summary>
        /// <value>
        /// 送餐人电话
        /// </value>
        /// 创建者：周超
        /// 创建日期：11/21/2013 7:19 PM
        /// 修改者：
        /// 修改时间：
        /// ----------------------------------------------------------------------------------------
        public string ContactNumber { get; set; }

        /// <summary>
        /// 设置或取得送餐人性别
        /// </summary>
        /// <value>
        /// 送餐人性别
        /// </value>
        /// 创建者：周超
        /// 创建日期：11/21/2013 7:19 PM
        /// 修改者：
        /// 修改时间：
        /// ----------------------------------------------------------------------------------------
        public string Contactsex { get; set; }

        /// <summary>
        /// 餐桌编号
        /// </summary>
        /// <value>
        /// The TabelNo
        /// </value>
        /// 创建者：王巍
        /// 创建日期：3/17/2014 10:46 AM
        /// 修改者：
        /// 修改时间：
        /// ----------------------------------------------------------------------------------------
        public string TabelNo { get; set; }

        /// <summary>
        /// 茶水费
        /// </summary>
        /// <value>
        /// The Total
        /// </value>
        /// 创建者：苏建峰
        /// 创建日期：2013/12/25 13:56
        /// 修改者：
        /// 修改时间：
        /// ----------------------------------------------------------------------------------------
        public string TeaBitFee { get; set; }

        /// <summary>
        /// 服务费
        /// </summary>
        /// <value>
        /// The Total
        /// </value>
        /// 创建者：苏建峰
        /// 创建日期：2013/12/25 13:56
        /// 修改者：
        /// 修改时间：
        /// ----------------------------------------------------------------------------------------
        public string ServiceFee { get; set; }

        /// <summary>
        /// 优惠
        /// </summary>
        /// <value>
        /// The Coupon
        /// </value>
        /// 创建者：苏建峰
        /// 创建日期：2013/12/25 13:56
        /// 修改者：
        /// 修改时间：
        /// ----------------------------------------------------------------------------------------
        public string Coupon { get; set; }

        /// <summary>
        /// 总计
        /// </summary>
        /// <value>
        /// The Total
        /// </value>
        /// 创建者：苏建峰
        /// 创建日期：2013/12/25 13:56
        /// 修改者：
        /// 修改时间：
        /// ----------------------------------------------------------------------------------------
        public string Total { get; set; }

        /// <summary>
        /// 设置或取得菜信息
        /// </summary>
        /// <value>
        /// 菜信息
        /// </value>
        /// 创建者：周超
        /// 创建日期：10/23/2013 9:23 PM
        /// 修改者：
        /// 修改时间：
        /// ----------------------------------------------------------------------------------------
        public List<DingTaiOrderDishModel> DishList { get; set; }

        /// <summary>
        /// 位子信息
        /// </summary>
        /// <value>
        /// The desk.
        /// </value>
        /// 创建者：苏建峰
        /// 创建日期：3/21/2014 8:14 PM
        /// 修改者：
        /// 修改时间：
        /// ----------------------------------------------------------------------------------------
        public DingTaiOrderDeskModel Desk { get; set; }
    }
}