namespace Ets.SingleApi.Model.Services
{
    /// <summary>
    /// 类名称：LightSupplierTemplateModel
    /// 命名空间：Ets.SingleApi.Model.Services
    /// 类功能：轻应用餐厅或集团模板数据
    /// </summary>
    /// 创建者：周超
    /// 创建日期：12/20/2013 11:43 AM
    /// 修改者：
    /// 修改时间：
    /// ----------------------------------------------------------------------------------------
    public class LightSupplierTemplateModel
    {
        /// <summary>
        /// 设置或取得轻应用唯一标识
        /// </summary>
        /// <value>
        /// 轻应用唯一标识
        /// </value>
        /// 创建者：周超
        /// 创建日期：12/20/2013 12:00 PM
        /// 修改者：
        /// 修改时间：
        /// ----------------------------------------------------------------------------------------
        public int LightApplicationId { get; set; }

        /// <summary>
        /// 设置或取得集团或餐厅标识
        /// </summary>
        /// <value>
        /// 集团或餐厅标识
        /// </value>
        /// 创建者：周超
        /// 创建日期：12/20/2013 12:01 PM
        /// 修改者：
        /// 修改时间：
        /// ----------------------------------------------------------------------------------------
        public int SupplierTypeId { get; set; }

        /// <summary>
        /// 设置或取得集团或餐厅模板类型
        /// </summary>
        /// <value>
        /// 集团或餐厅模板类型
        /// </value>
        /// 创建者：周超
        /// 创建日期：12/20/2013 12:01 PM
        /// 修改者：
        /// 修改时间：
        /// ----------------------------------------------------------------------------------------
        public int TemplateTypeId { get; set; }

        /// <summary>
        /// 设置或取得集团或餐厅模板颜色
        /// </summary>
        /// <value>
        /// 集团或餐厅模板颜色
        /// </value>
        /// 创建者：周超
        /// 创建日期：12/20/2013 12:01 PM
        /// 修改者：
        /// 修改时间：
        /// ----------------------------------------------------------------------------------------
        public int TemplateColorId { get; set; }
    }
}
