namespace Ets.SingleApi.Model.Services
{
    /// <summary>
    /// 类名称：LocationCity
    /// 命名空间：Ets.SingleApi.Model.Services
    /// 类功能：定位信息
    /// </summary>
    /// 创建者：周超
    /// 创建日期：1/8/2014 12:08 PM
    /// 修改者：
    /// 修改时间：
    /// ----------------------------------------------------------------------------------------
    public class LocationCity
    {
        /// <summary>
        /// 设置或取得省份
        /// </summary>
        /// <value>
        /// 省份
        /// </value>
        /// 创建者：周超
        /// 创建日期：1/8/2014 12:06 PM
        /// 修改者：
        /// 修改时间：
        /// ----------------------------------------------------------------------------------------
        public string Province { get; set; }

        /// <summary>
        /// 设置或取得城市编号
        /// </summary>
        /// <value>
        /// 城市编号
        /// </value>
        /// 创建者：周超
        /// 创建日期：1/8/2014 12:06 PM
        /// 修改者：
        /// 修改时间：
        /// ----------------------------------------------------------------------------------------
        public int? CityCode { get; set; }

        /// <summary>
        /// 设置或取得城市
        /// </summary>
        /// <value>
        /// 城市
        /// </value>
        /// 创建者：周超
        /// 创建日期：1/8/2014 12:06 PM
        /// 修改者：
        /// 修改时间：
        /// ----------------------------------------------------------------------------------------
        public string City { get; set; }

        /// <summary>
        /// 设置或取得区县
        /// </summary>
        /// <value>
        /// 区县
        /// </value>
        /// 创建者：周超
        /// 创建日期：1/8/2014 12:06 PM
        /// 修改者：
        /// 修改时间：
        /// ----------------------------------------------------------------------------------------
        public string District { get; set; }

        /// <summary>
        /// 设置或取得街道
        /// </summary>
        /// <value>
        /// 街道
        /// </value>
        /// 创建者：周超
        /// 创建日期：1/8/2014 12:06 PM
        /// 修改者：
        /// 修改时间：
        /// ----------------------------------------------------------------------------------------
        public string Street { get; set; }

        /// <summary>
        /// 设置或取得街道门牌号
        /// </summary>
        /// <value>
        /// 街道门牌号
        /// </value>
        /// 创建者：周超
        /// 创建日期：1/8/2014 12:06 PM
        /// 修改者：
        /// 修改时间：
        /// ----------------------------------------------------------------------------------------
        public string StreetNumber { get; set; }

        /// <summary>
        /// 设置或取得详细地址
        /// </summary>
        /// <value>
        /// 详细地址
        /// </value>
        /// 创建者：周超
        /// 创建日期：1/8/2014 12:06 PM
        /// 修改者：
        /// 修改时间：
        /// ----------------------------------------------------------------------------------------
        public string Address { get; set; }
    }
}
