namespace Ets.SingleApi.Model.Services
{
    /// <summary>
    /// 类名称：ParameterBase
    /// 命名空间：Ets.SingleApi.Model.Services
    /// 类功能：
    /// </summary>
    /// 创建者：单琪彬
    /// 创建日期：2/19/2014 5:29 PM
    /// 修改者：
    /// 修改时间：
    /// ----------------------------------------------------------------------------------------
    public class ParameterBase
    {
        /// <summary>
        /// 客户端应用名称 +业务场景。 如用户在眉州东坡找回密码时，可传值：眉州东坡web找回密码
        /// </summary>
        /// <value>
        /// The SmsSource
        /// </value>
        /// 创建者：单琪彬
        /// 创建日期：2/19/2014 3:04 PM
        /// 修改者：
        /// 修改时间：
        /// ----------------------------------------------------------------------------------------
        public string SmsSource { get; set; }

        /// <summary>
        /// 如果客户端调用时业务场景无餐厅概念（如用户注册），传入null即可
        /// </summary>
        /// <value>
        /// The SupplierId
        /// </value>
        /// 创建者：单琪彬
        /// 创建日期：2/19/2014 3:04 PM
        /// 修改者：
        /// 修改时间：
        /// ----------------------------------------------------------------------------------------
        public int? SupplierId { get; set; }

        /// <summary>
        /// 是否要语音短信
        /// </summary>
        /// <value>
        /// The IsVoiceSms
        /// </value>
        /// 创建者：单琪彬
        /// 创建日期：2/19/2014 3:04 PM
        /// 修改者：
        /// 修改时间：
        /// ----------------------------------------------------------------------------------------
        public bool IsVoiceSms { get; set; }
    }
}
