namespace Ets.SingleApi.Model.Services
{
    /// <summary>
    /// 类名称：SaveDirectPayParameter
    /// 命名空间：Ets.SingleApi.Model.Services
    /// 类功能：保存当面付信息
    /// </summary>
    /// 创建者：王巍
    /// 创建日期：4/30/2014 11:03 AM
    /// 修改者：
    /// 修改时间：
    /// ----------------------------------------------------------------------------------------
    public class SaveDirectPayParameter
    {
        /// <summary>
        /// 餐厅Id
        /// </summary>
        /// <value>
        /// 餐厅Id
        /// </value>
        /// 创建者：王巍
        /// 创建日期：4/30/2014 11:07 AM
        /// 修改者：
        /// 修改时间：
        /// ----------------------------------------------------------------------------------------
        public int SupplierId { get; set; }

        /// <summary>
        /// 电话号码
        /// </summary>
        /// <value>
        /// 电话号码
        /// </value>
        /// 创建者：王巍
        /// 创建日期：4/30/2014 11:07 AM
        /// 修改者：
        /// 修改时间：
        /// ----------------------------------------------------------------------------------------
        public string Telephone { get; set; }

        /// <summary>
        /// 支付方式Id
        /// </summary>
        /// <value>
        /// 支付方式Id
        /// </value>
        /// 创建者：王巍
        /// 创建日期：4/30/2014 11:08 AM
        /// 修改者：
        /// 修改时间：
        /// ----------------------------------------------------------------------------------------
        public int PaymentMethodId { get; set; }

        /// <summary>
        /// 用户优惠金额
        /// </summary>
        /// <value>
        /// 用户优惠金额
        /// </value>
        /// 创建者：王巍
        /// 创建日期：4/30/2014 11:07 AM
        /// 修改者：
        /// 修改时间：
        /// ----------------------------------------------------------------------------------------
        public decimal CustomerCouponTotal { get; set; }

        /// <summary>
        /// 餐厅优惠金额
        /// </summary>
        /// <value>
        /// The SupplierCouponTotal
        /// </value>
        /// 创建者：王巍
        /// 创建日期：5/5/2014 2:16 PM
        /// 修改者：
        /// 修改时间：
        /// ----------------------------------------------------------------------------------------
        public decimal SupplierCouponTotal { get; set; }

        /// <summary>
        /// 用户实付金额
        /// </summary>
        /// <value>
        /// 用户实付金额
        /// </value>
        /// 创建者：王巍
        /// 创建日期：5/5/2014 2:17 PM
        /// 修改者：
        /// 修改时间：
        /// ----------------------------------------------------------------------------------------
        public decimal CustomerTotal { get; set; }

        /// <summary>
        /// 应付总金额
        /// </summary>
        /// <value>
        /// The Total
        /// </value>
        /// 创建者：王巍
        /// 创建日期：5/5/2014 2:17 PM
        /// 修改者：
        /// 修改时间：
        /// ----------------------------------------------------------------------------------------
        public decimal Total { get; set; }

        /// <summary>
        /// 用户Id
        /// </summary>
        /// <value>
        /// 用户Id
        /// </value>
        /// 创建者：王巍
        /// 创建日期：4/30/2014 11:07 AM
        /// 修改者：
        /// 修改时间：
        /// ----------------------------------------------------------------------------------------
        public int UserId { get; set; }

        /// <summary>
        /// 用户IP地址
        /// </summary>
        /// <value>
        /// The IPAddress
        /// </value>
        /// 创建者：王巍
        /// 创建日期：4/30/2014 2:43 PM
        /// 修改者：
        /// 修改时间：
        /// ----------------------------------------------------------------------------------------
        public string IPAddress { get; set; }

        /// <summary>
        /// 支付银行
        /// </summary>
        /// <value>
        /// The PayBank
        /// </value>
        /// 创建者：王巍
        /// 创建日期：4/30/2014 2:48 PM
        /// 修改者：
        /// 修改时间：
        /// ----------------------------------------------------------------------------------------
        public string PayBank { get; set; }

        /// <summary>
        /// 订单渠道
        /// </summary>
        /// <value>
        /// The SourceType
        /// </value>
        /// 创建者：王巍
        /// 创建日期：4/30/2014 11:07 AM
        /// 修改者：
        /// 修改时间：
        /// ----------------------------------------------------------------------------------------
        public string SourceType { get; set; }

        /// <summary>
        /// 订单来源
        /// </summary>
        /// <value>
        /// The Template
        /// </value>
        /// 创建者：王巍
        /// 创建日期：4/30/2014 11:07 AM
        /// 修改者：
        /// 修改时间：
        /// ----------------------------------------------------------------------------------------
        public string Template { get; set; }
    }
}