namespace Ets.SingleApi.Model.Services
{
    /// <summary>
    /// 类名称：SinaWeiBoPaymentStateParameter
    /// 命名空间：Ets.SingleApi.Model.Services
    /// 类功能：新浪微博支付，查询并更新订单支付状态
    /// </summary>
    /// 创建者：王巍
    /// 创建日期：2/14/2014 2:52 PM
    /// 修改者：
    /// 修改时间：
    /// ----------------------------------------------------------------------------------------
    public class SinaWeiBoPaymentStateParameter
    {
        /// <summary>
        /// 设置或取得 前台通知返回为签名字符串
        /// </summary>
        /// <value>
        /// 前台通知返回为签名字符串
        /// </value>
        /// 创建者：王巍
        /// 创建日期：2/14/2014 2:52 PM
        /// 修改者：
        /// 修改时间：
        /// ----------------------------------------------------------------------------------------
        public string NotSign { get; set; }

        /// <summary>
        /// 设置或取得 签名字符串
        /// </summary>
        /// <value>
        /// 签名字符串
        /// </value>
        /// 创建者：王巍
        /// 创建日期：3/10/2014 6:11 PM
        /// 修改者：
        /// 修改时间：
        /// ----------------------------------------------------------------------------------------
        public string Sign { get; set; }

        /// <summary>
        /// 设置或取得 订单编号
        /// </summary>
        /// <value>
        /// 订单编号
        /// </value>
        /// 创建者：王巍
        /// 创建日期：3/10/2014 6:11 PM
        /// 修改者：
        /// 修改时间：
        /// ----------------------------------------------------------------------------------------
        public string OrderId { get; set; }

        /// <summary>
        /// 设置或取得 返回结果
        /// </summary>
        /// <value>
        /// 返回结果
        /// </value>
        /// 创建者：王巍
        /// 创建日期：3/10/2014 6:12 PM
        /// 修改者：
        /// 修改时间：
        /// ----------------------------------------------------------------------------------------
        public string Result { get; set; }
        /// <summary>
        /// 设置或取得 订单类型
        /// </summary>
        /// <value>
        /// 订单类型
        /// </value>
        /// 创建者：王巍
        /// 创建日期：2/14/2014 2:52 PM
        /// 修改者：
        /// 修改时间：
        /// ----------------------------------------------------------------------------------------
        public int OrderType { get; set; }
    }
}
