namespace Ets.SingleApi.Model.Services
{
    /// <summary>
    /// 类名称：SupplierCouponModel
    /// 命名空间：Ets.SingleApi.Model.Services
    /// 类功能：折扣实体
    /// </summary>
    /// 创建者：周超
    /// 创建日期：12/7/2013 12:45 PM
    /// 修改者：
    /// 修改时间：
    /// ----------------------------------------------------------------------------------------
    public class SupplierCouponCodeModel
    {
        /// <summary>
        /// 设置或取得优惠Id
        /// </summary>
        /// <value>
        /// 折扣Id
        /// </value>
        /// 创建者：周超
        /// 创建日期：12/7/2013 12:46 PM
        /// 修改者：
        /// 修改时间：
        /// ----------------------------------------------------------------------------------------
        public int CouponId { get; set; }

        /// <summary>
        /// 设置或取得优惠码
        /// </summary>
        /// <value>
        /// 折扣Id
        /// </value>
        /// 创建者：周超
        /// 创建日期：12/7/2013 12:46 PM
        /// 修改者：
        /// 修改时间：
        /// ----------------------------------------------------------------------------------------
        public string CouponCode { get; set; }

        /// <summary>
        /// 设置或取得折扣率
        /// </summary>
        /// <value>
        /// 折扣率
        /// </value>
        /// 创建者：周超
        /// 创建日期：12/7/2013 12:46 PM
        /// 修改者：
        /// 修改时间：
        /// ----------------------------------------------------------------------------------------
        public decimal Discount { get; set; }

        /// <summary>
        /// 优惠金额
        /// </summary>
        /// <value>
        /// 优惠金额
        /// </value>
        /// 创建者：周超
        /// 创建日期：12/7/2013 12:46 PM
        /// 修改者：
        /// 修改时间：
        /// ----------------------------------------------------------------------------------------
        public decimal DiscountAmount { get; set; }

        /// <summary>
        /// 应付金额
        /// </summary>
        /// <value>
        /// 应付金额
        /// </value>
        /// 创建者：周超
        /// 创建日期：12/7/2013 12:46 PM
        /// 修改者：
        /// 修改时间：
        /// ----------------------------------------------------------------------------------------
        public decimal AmountPayable { get; set; }

        /// <summary>
        /// 设置或取得打折类型Id
        /// </summary>
        /// <value>
        /// 打折类型Id
        /// </value>
        /// 创建者：周超
        /// 创建日期：12/9/2013 9:06 AM
        /// 修改者：
        /// 修改时间：
        /// ----------------------------------------------------------------------------------------
        public int CouponTypeId { get; set; }
    }
}