namespace Ets.SingleApi.Model.Services
{
    using System;

    /// <summary>
    /// 类名称：TangShiOrderModel
    /// 命名空间：Ets.SingleApi.Model.Services
    /// 类功能：堂食订单
    /// </summary>
    /// 创建者：周超
    /// 创建日期：2013/10/20 15:48
    /// 修改者：
    /// 修改时间：
    /// ----------------------------------------------------------------------------------------
    public class TangShiOrderModel : IOrderModel
    {
        /// <summary>
        /// 设置或取得订单号
        /// </summary>
        /// <value>
        /// 订单号
        /// </value>
        /// 创建者：周超
        /// 创建日期：2013/10/20 15:44
        /// 修改者：
        /// 修改时间：
        /// ----------------------------------------------------------------------------------------
        public int OrderId { get; set; }

        /// <summary>
        /// 设置或取得餐厅Id
        /// </summary>
        /// <value>
        /// 餐厅Id
        /// </value>
        /// 创建者：周超
        /// 创建日期：2013/10/20 15:44
        /// 修改者：
        /// 修改时间：
        /// ----------------------------------------------------------------------------------------
        public int SupplierId { get; set; }

        /// <summary>
        /// 设置或取得餐厅名称
        /// </summary>
        /// <value>
        /// 餐厅名称
        /// </value>
        /// 创建者：周超
        /// 创建日期：2013/10/20 15:44
        /// 修改者：
        /// 修改时间：
        /// ----------------------------------------------------------------------------------------
        public string SupplierName { get; set; }

        /// <summary>
        /// 设置或取得下单时间
        /// </summary>
        /// <value>
        /// 下单时间
        /// </value>
        /// 创建者：周超
        /// 创建日期：2013/10/20 15:44
        /// 修改者：
        /// 修改时间：
        /// ----------------------------------------------------------------------------------------
        public DateTime? DateReserved { get; set; }

        /// <summary>
        /// 设置或取得订单类型
        /// </summary>
        /// <value>
        /// 订单类型
        /// </value>
        /// 创建者：周超
        /// 创建日期：2013/10/20 15:45
        /// 修改者：
        /// 修改时间：
        /// ----------------------------------------------------------------------------------------
        public int OrderType { get; set; }

        /// <summary>
        /// 设置或取得订单状态
        /// </summary>
        /// <value>
        /// 订单状态
        /// </value>
        /// 创建者：周超
        /// 创建日期：2013/10/20 15:45
        /// 修改者：
        /// 修改时间：
        /// ----------------------------------------------------------------------------------------
        public int OrderStatus { get; set; }

        /// <summary>
        /// 设置或取得客户总消费
        /// </summary>
        /// <value>
        /// 客户总消费
        /// </value>
        /// 创建者：周超
        /// 创建日期：2013/10/20 15:45
        /// 修改者：
        /// 修改时间：
        /// ----------------------------------------------------------------------------------------
        public decimal CustomerTotal { get; set; }

        /// <summary>
        /// 设置或取得就餐人数
        /// </summary>
        /// <value>
        /// 就餐人数
        /// </value>
        /// 创建者：周超
        /// 创建日期：2013/10/20 15:47
        /// 修改者：
        /// 修改时间：
        /// ----------------------------------------------------------------------------------------
        public int DineNumber { get; set; }
    }
}