namespace Ets.SingleApi.Model
{
    /// <summary>
    /// 类名称：ShoppingCartBase
    /// 命名空间：Ets.SingleApi.Model
    /// 类功能：绑定购物车的结果
    /// </summary>
    /// 创建者：周超
    /// 创建日期：11/20/2013 10:35 PM
    /// 修改者：
    /// 修改时间：
    /// ----------------------------------------------------------------------------------------
    public class BindShoppingCartResult
    {
        /// <summary>
        /// 设置或取得购物车Id
        /// </summary>
        /// <value>
        /// 购物车Id
        /// </value>
        /// 创建者：周超
        /// 创建日期：11/20/2013 10:35 PM
        /// 修改者：
        /// 修改时间：
        /// ----------------------------------------------------------------------------------------
        public string ShoppingCartId { get; set; }

        /// <summary>
        /// 设置或取得是否为新的购物车
        /// </summary>
        /// <value>
        /// 是否为新的购物车
        /// </value>
        /// 创建者：周超
        /// 创建日期：11/20/2013 10:35 PM
        /// 修改者：
        /// 修改时间：
        /// ----------------------------------------------------------------------------------------
        public bool IsNew { get; set; }
    }
}