namespace Ets.SingleApi.Services
{
    /// <summary>
    /// 类名称：AlilpayPaymentQueryData
    /// 命名空间：Ets.SingleApi.Services.Payment
    /// 类功能：支付宝查询订单支付状态
    /// </summary>
    /// 创建者：王巍
    /// 创建日期：3/10/2014 5:00 PM
    /// 修改者：
    /// 修改时间：
    /// ----------------------------------------------------------------------------------------
    public class AlipayPaymentQueryData : IPaymentData
    {
        /// <summary>
        /// 设置或取得 前台通知返回为签名字符串
        /// </summary>
        /// <value>
        /// 前台通知返回为签名字符串
        /// </value>
        /// 创建者：王巍
        /// 创建日期：2/14/2014 2:52 PM
        /// 修改者：
        /// 修改时间：
        /// ----------------------------------------------------------------------------------------
        public string NotSign { get; set; }

        /// <summary>
        /// 设置或取得 签名字符串
        /// </summary>
        /// <value>
        /// 签名字符串
        /// </value>
        /// 创建者：王巍
        /// 创建日期：3/10/2014 6:11 PM
        /// 修改者：
        /// 修改时间：
        /// ----------------------------------------------------------------------------------------
        public string Sign { get; set; }

        /// <summary>
        /// 设置或取得 订单编号
        /// </summary>
        /// <value>
        /// 订单编号
        /// </value>
        /// 创建者：王巍
        /// 创建日期：3/10/2014 6:11 PM
        /// 修改者：
        /// 修改时间：
        /// ----------------------------------------------------------------------------------------
        public string OrderId { get; set; }

        /// <summary>
        /// 设置或取得 返回结果
        /// </summary>
        /// <value>
        /// 返回结果
        /// </value>
        /// 创建者：王巍
        /// 创建日期：3/10/2014 6:12 PM
        /// 修改者：
        /// 修改时间：
        /// ----------------------------------------------------------------------------------------
        public string Result { get; set; }
    }
}
