namespace Ets.SingleApi.Model
{
    /// <summary>
    /// 购物车类型
    /// </summary>
    /// 创建者：周超
    /// 创建日期：11/21/2013 10:19 AM
    /// 修改者：
    /// 修改时间：
    /// ----------------------------------------------------------------------------------------
    public enum BusinessType
    {
        /// <summary>
        /// 餐厅
        /// </summary>
        /// 创建者：周超
        /// 创建日期：11/21/2013 10:19 AM
        /// 修改者：
        /// 修改时间：
        /// ----------------------------------------------------------------------------------------
        Supplier = 1
    }
}