namespace Ets.SingleApi.Model
{
    /// <summary>
    /// 类名称：CouponCodeType
    /// 命名空间：Ets.SingleApi.Model
    /// 类功能：优惠码类型
    /// </summary>
    /// 创建者：单琪彬
    /// 创建日期：4/21/2014 10:08 AM
    /// 修改者：
    /// 修改时间：
    /// ----------------------------------------------------------------------------------------
    public enum CouponCodeType
    {
        /// <summary>
        /// 百分比折扣
        /// </summary>
        /// 创建者：单琪彬
        /// 创建日期：4/21/2014 10:13 AM
        /// 修改者：
        /// 修改时间：
        /// ----------------------------------------------------------------------------------------
        Percent = 1,

        /// <summary>
        /// 现金券
        /// </summary>
        /// 创建者：单琪彬
        /// 创建日期：4/21/2014 10:14 AM
        /// 修改者：
        /// 修改时间：
        /// ----------------------------------------------------------------------------------------
        Cash = 3,

        /// <summary>
        /// 免送餐费
        /// </summary>
        /// 创建者：单琪彬
        /// 创建日期：4/21/2014 10:14 AM
        /// 修改者：
        /// 修改时间：
        /// ----------------------------------------------------------------------------------------
        SendMeal = 8
    }
}
