namespace Ets.SingleApi.Model
{
    /// <summary>
    /// 取餐方式类型
    /// </summary>
    /// 创建者：周超
    /// 创建日期：12/6/2013 5:30 PM
    /// 修改者：
    /// 修改时间：
    /// ----------------------------------------------------------------------------------------
    public enum DeliveryMethodType
    {
        /// <summary>
        /// 自提方式
        /// </summary>
        /// 创建者：周超
        /// 创建日期：12/6/2013 5:31 PM
        /// 修改者：
        /// 修改时间：
        /// ----------------------------------------------------------------------------------------
        PickUp = 1,

        /// <summary>
        /// 送餐上门
        /// </summary>
        /// 创建者：周超
        /// 创建日期：12/6/2013 5:31 PM
        /// 修改者：
        /// 修改时间：
        /// ----------------------------------------------------------------------------------------
        Delivery = 2
    }
}