namespace Ets.SingleApi.Model
{
    /// <summary>
    /// 过滤餐厅列表的方式
    /// </summary>
    /// 创建者：苏建峰
    /// 创建日期：2014-2-10 16:49
    /// 修改者：
    /// 修改时间：
    /// ----------------------------------------------------------------------------------------
    public enum FilteredSupplierWay
    {
        /// <summary>
        /// 过滤集团
        /// </summary>
        /// 创建者：苏建峰
        /// 创建日期：2014-2-10 16:51
        /// 修改者：
        /// 修改时间：
        /// ----------------------------------------------------------------------------------------
        FilteredGroupId = 1,

        /// <summary>
        /// 保留集团
        /// </summary>
        /// 创建者：苏建峰
        /// 创建日期：2014-2-11 9:50
        /// 修改者：
        /// 修改时间：
        /// ----------------------------------------------------------------------------------------
        RetentionGroupId = 0,

        /// <summary>
        /// 过滤餐厅Id
        /// </summary>
        /// 创建者：苏建峰
        /// 创建日期：2014-2-10 16:51
        /// 修改者：
        /// 修改时间：
        /// ----------------------------------------------------------------------------------------
        FilteredSupplierId = 2,

        /// <summary>
        /// 过滤餐厅名称关键字
        /// </summary>
        /// 创建者：苏建峰
        /// 创建日期：2014-2-10 16:51
        /// 修改者：
        /// 修改时间：
        /// ----------------------------------------------------------------------------------------
        FilteredKeyWord = 3,
    }
}