namespace Ets.SingleApi.Model
{
    /// <summary>
    /// 定位类型
    /// </summary>
    /// 创建者：周超
    /// 创建日期：11/15/2013 1:32 PM
    /// 修改者：
    /// 修改时间：
    /// ----------------------------------------------------------------------------------------
    public enum LocationType
    {
        /// <summary>
        /// 百度定位
        /// </summary>
        /// 创建者：周超
        /// 创建日期：11/15/2013 1:33 PM
        /// 修改者：
        /// 修改时间：
        /// ----------------------------------------------------------------------------------------
        Baidu = 0
    }
}