namespace Ets.SingleApi.Model
{
    /// <summary>
    /// 类名称：Location
    /// 命名空间：Ets.SingleApi.Model
    /// 类功能：坐标
    /// </summary>
    /// 创建者：周超
    /// 创建日期：11/4/2013 3:46 PM
    /// 修改者：
    /// 修改时间：
    /// ----------------------------------------------------------------------------------------
    public class Location
    {
        /// <summary>
        /// Initializes a new instance of the <see cref="Location"/> class.
        /// </summary>
        /// 创建者：周超
        /// 创建日期：11/15/2013 1:24 PM
        /// 修改者：
        /// 修改时间：
        /// ----------------------------------------------------------------------------------------
        public Location()
        {
            this.Lat = -1;
            this.Lng = -1;
        }

        /// <summary>
        /// 取得或设置纬度值
        /// </summary>
        /// <value>
        /// 纬度值
        /// </value>
        /// 创建者：周超
        /// 创建日期：11/4/2013 3:47 PM
        /// 修改者：
        /// 修改时间：
        /// ----------------------------------------------------------------------------------------
        public double Lat { get; set; }

        /// <summary>
        /// 取得或设置经度值
        /// </summary>
        /// <value>
        /// 经度值
        /// </value>
        /// 创建者：周超
        /// 创建日期：11/4/2013 3:47 PM
        /// 修改者：
        /// 修改时间：
        /// ----------------------------------------------------------------------------------------
        public double Lng { get; set; }
    }
}
