namespace Ets.SingleApi.Model
{
    /// <summary>
    /// 订单来源
    /// </summary>
    /// 创建者：周超
    /// 创建日期：12/17/2013 2:55 PM
    /// 修改者：
    /// 修改时间：
    /// ----------------------------------------------------------------------------------------
    public enum OrderSourceType
    {
        /// <summary>
        /// 字段Default
        /// </summary>
        /// 创建者：周超
        /// 创建日期：12/17/2013 2:59 PM
        /// 修改者：
        /// 修改时间：
        /// ----------------------------------------------------------------------------------------
        Default = 0,

        /// <summary>
        /// 字段HaiDiLao
        /// </summary>
        /// 创建者：周超
        /// 创建日期：12/17/2013 2:59 PM
        /// 修改者：
        /// 修改时间：
        /// ----------------------------------------------------------------------------------------
        HaiDiLao = 1
    }
}