namespace Ets.SingleApi.Model
{
    /// <summary>
    /// 订单来源
    /// </summary>
    /// 创建者：周超
    /// 创建日期：12/17/2013 2:55 PM
    /// 修改者：
    /// 修改时间：
    /// ----------------------------------------------------------------------------------------
    public enum OrderSourceType
    {
        /// <summary>
        /// 字段Default 百度轻应用
        /// </summary>
        /// 创建者：周超
        /// 创建日期：12/17/2013 2:59 PM
        /// 修改者：
        /// 修改时间：
        /// ----------------------------------------------------------------------------------------
        Default = 0,

        /// <summary>
        /// 字段HaiDiLao 海底捞定制
        /// </summary>
        /// 创建者：周超
        /// 创建日期：12/17/2013 2:59 PM
        /// 修改者：
        /// 修改时间：
        /// ----------------------------------------------------------------------------------------
        HaiDiLao = 1,

        /// <summary>
        /// 字段HuangTaiJi 黄太吉微信餐厅
        /// </summary>
        /// 创建者：周超
        /// 创建日期：12/17/2013 2:59 PM
        /// 修改者：
        /// 修改时间：
        /// ----------------------------------------------------------------------------------------
        HuangTaiJi = 2,

        /// <summary>
        /// 字段EtsWap 易淘食Wap
        /// </summary>
        /// 创建者：周超
        /// 创建日期：12/17/2013 2:59 PM
        /// 修改者：
        /// 修改时间：
        /// ----------------------------------------------------------------------------------------
        EtsWap = 3,
    }
}