namespace Ets.SingleApi.Model
{
    /// <summary>
    /// 类名称：OrderBy
    /// 命名空间：Ets.SingleApi.Model
    /// 类功能：排序规则
    /// </summary>
    /// 创建者：周超
    /// 创建日期：2013/10/18 22:17
    /// 修改者：
    /// 修改时间：
    /// ----------------------------------------------------------------------------------------
    public class OrderBy
    {
        /// <summary>
        /// 餐厅排序表达式
        /// </summary>
        /// <param name="supplier">餐厅排序规则</param>
        /// <returns>
        /// 餐厅排序表达式
        /// </returns>
        /// 创建者：周超
        /// 创建日期：2013/10/18 22:22
        /// 修改者：
        /// 修改时间：
        /// ----------------------------------------------------------------------------------------
        public static string SupplierExpression(Supplier supplier)
        {
            if (supplier == Supplier.Default)
            {
                return "[SupplierId] ASC";
            }

            if (supplier == Supplier.Nearest)
            {
                return "[Distance] ASC";
            }

            if (supplier == Supplier.Farthest)
            {
                return "[Distance] DESC";
            }

            if (supplier == Supplier.Newest)
            {
                return "[DateJoined] DESC";
            }

            if (supplier == Supplier.Cheapest)
            {
                return "[averageprice] ASC";
            }

            if (supplier == Supplier.Expensive)
            {
                return "[averageprice] DESC";
            }

            return "[SupplierId] ASC";
        }

        /// <summary>
        /// 餐厅排序规则
        /// </summary>
        /// 创建者：周超
        /// 创建日期：2013/10/18 22:19
        /// 修改者：
        /// 修改时间：
        /// ----------------------------------------------------------------------------------------
        public enum Supplier
        {
            /// <summary>
            /// 默认排序
            /// </summary>
            /// 创建者：周超
            /// 创建日期：2013/10/18 22:19
            /// 修改者：
            /// 修改时间：
            /// ----------------------------------------------------------------------------------------
            Default = 0,

            /// <summary>
            /// 离我最近
            /// </summary>
            /// 创建者：周超
            /// 创建日期：2013/10/18 22:20
            /// 修改者：
            /// 修改时间：
            /// ----------------------------------------------------------------------------------------
            Nearest = 1,

            /// <summary>
            /// 离我最远
            /// </summary>
            /// 创建者：周超
            /// 创建日期：2013/10/18 22:20
            /// 修改者：
            /// 修改时间：
            /// ----------------------------------------------------------------------------------------
            Farthest = 2,

            /// <summary>
            /// 最新上线
            /// </summary>
            /// 创建者：周超
            /// 创建日期：2013/10/18 22:20
            /// 修改者：
            /// 修改时间：
            /// ----------------------------------------------------------------------------------------
            Newest = 3,

            /// <summary>
            /// 价格最低
            /// </summary>
            /// 创建者：周超
            /// 创建日期：2013/10/18 22:21
            /// 修改者：
            /// 修改时间：
            /// ----------------------------------------------------------------------------------------
            Cheapest = 4,

            /// <summary>
            /// 价格最高
            /// </summary>
            /// 创建者：周超
            /// 创建日期：2013/10/18 22:21
            /// 修改者：
            /// 修改时间：
            /// ----------------------------------------------------------------------------------------
            Expensive = 5
        }
    }
}