using System;
using System.Collections.Generic;

namespace Ets.SingleApi.Model.ExternalServices
{
    /// <summary>
    /// 类名称：DeliveryRequest
    /// 命名空间：Ets.SingleApi.Model.ExternalServices
    /// 类功能：外卖订单信息
    /// </summary>
    /// 创建者：王巍
    /// 创建日期：5/22/2014 4:17 PM
    /// 修改者：
    /// 修改时间：
    /// ----------------------------------------------------------------------------------------
    public class DeliveryRequest 
    {
        /// <summary>
        /// 餐厅Id
        /// </summary>
        /// <value>
        /// The Supplierid
        /// </value>
        /// 创建者：王巍
        /// 创建日期：5/22/2014 4:17 PM
        /// 修改者：
        /// 修改时间：
        /// ----------------------------------------------------------------------------------------
        public int? supplierid { get; set; }

        /// <summary>
        /// 订单号
        /// </summary>
        /// <value>
        /// the orderno
        /// </value>
        /// 创建者：王巍
        /// 创建日期：5/22/2014 4:17 pm
        /// 修改者：
        /// 修改时间：
        /// ----------------------------------------------------------------------------------------
        public int? orderno { get; set; }

        /// <summary>
        /// 路径
        /// </summary>
        /// <value>
        /// the path
        /// </value>
        /// 创建者：王巍
        /// 创建日期：5/22/2014 4:17 pm
        /// 修改者：
        /// 修改时间：
        /// ----------------------------------------------------------------------------------------
        public string path { get; set; }

        /// <summary>
        /// 付费类型id paymenttypeid
        /// </summary>
        /// <value>
        /// the type of the pay.
        /// </value>
        /// 创建者：王巍
        /// 创建日期：5/22/2014 4:16 pm
        /// 修改者：
        /// 修改时间：
        /// ----------------------------------------------------------------------------------------
        public int paytype { get; set; }

        /// <summary>
        /// 订单状态
        /// </summary>
        /// <value>
        /// the orderstatus
        /// </value>
        /// 创建者：王巍
        /// 创建日期：5/22/2014 4:16 pm
        /// 修改者：
        /// 修改时间：
        /// ----------------------------------------------------------------------------------------
        public int orderstatus { get; set; }

        /// <summary>
        /// 备注
        /// </summary>
        /// <value>
        /// the remark
        /// </value>
        /// 创建者：王巍
        /// 创建日期：5/22/2014 4:16 pm
        /// 修改者：
        /// 修改时间：
        /// ----------------------------------------------------------------------------------------
        public string remark { get; set; }

        /// <summary>
        /// 来源
        /// </summary>
        /// <value>
        /// the source
        /// </value>
        /// 创建者：王巍
        /// 创建日期：5/22/2014 4:15 pm
        /// 修改者：
        /// 修改时间：
        /// ----------------------------------------------------------------------------------------
        public string source { get; set; }

        /// <summary>
        /// 取餐类型 1 自行取餐，2 易淘送或餐厅自送(未签约易淘送)
        /// </summary>
        /// <value>
        /// the deliverymethodid
        /// </value>
        /// 创建者：王巍
        /// 创建日期：5/22/2014 4:15 pm
        /// 修改者：
        /// 修改时间：
        /// ----------------------------------------------------------------------------------------
        public int? deliverymethodid { get; set; }

        /// <summary>
        /// 投递时间
        /// </summary>
        /// <value>
        /// the deliverydate
        /// </value>
        /// 创建者：王巍
        /// 创建日期：5/22/2014 4:14 pm
        /// 修改者：
        /// 修改时间：
        /// ----------------------------------------------------------------------------------------
        public string deliverydate { get; set; }

        /// <summary>
        /// 送餐费
        /// </summary>
        /// <value>
        /// the delivercharge
        /// </value>
        /// 创建者：王巍
        /// 创建日期：5/22/2014 4:14 pm
        /// 修改者：
        /// 修改时间：
        /// ----------------------------------------------------------------------------------------
        public decimal? delivercharge { get; set; }

        /// <summary>
        /// 订单所属片区
        /// </summary>
        /// <value>
        /// the areaid
        /// </value>
        /// 创建者：王巍
        /// 创建日期：5/22/2014 4:13 pm
        /// 修改者：
        /// 修改时间：
        /// ----------------------------------------------------------------------------------------
        public int areaid { get; set; }

        /// <summary>
        /// 总价
        /// </summary>
        /// <value>
        /// the total
        /// </value>
        /// 创建者：王巍
        /// 创建日期：5/22/2014 4:13 pm
        /// 修改者：
        /// 修改时间：
        /// ----------------------------------------------------------------------------------------
        public decimal? total { get; set; }

        /// <summary>
        /// 应收用户金额
        /// </summary>
        /// <value>
        /// the customertotal
        /// </value>
        /// 创建者：王巍
        /// 创建日期：5/22/2014 4:03 pm
        /// 修改者：
        /// 修改时间：
        /// ----------------------------------------------------------------------------------------
        public decimal? customertotal { get; set; }

        /// <summary>
        /// 应付餐厅金额 etstakefoodamount
        /// </summary>
        /// <value>
        /// the etstakeprice
        /// </value>
        /// 创建者：王巍
        /// 创建日期：5/22/2014 4:02 pm
        /// 修改者：
        /// 修改时间：
        /// ----------------------------------------------------------------------------------------
        public decimal? etstakeprice { get; set; }

        /// <summary>
        /// 发票类型：个人，公司
        /// </summary>
        /// <value>
        /// the type of the invoice.
        /// </value>
        /// 创建者：王巍
        /// 创建日期：5/22/2014 4:02 pm
        /// 修改者：
        /// 修改时间：
        /// ----------------------------------------------------------------------------------------
        public string invoicetype { get; set; }

        /// <summary>
        /// 发票头
        /// </summary>
        /// <value>
        /// the invoicetitle
        /// </value>
        /// 创建者：王巍
        /// 创建日期：5/22/2014 4:02 pm
        /// 修改者：
        /// 修改时间：
        /// ----------------------------------------------------------------------------------------
        public string invoicetitle { get; set; }

        /// <summary>
        /// 打包费
        /// </summary>
        /// <value>
        /// the packagingfee
        /// </value>
        /// 创建者：王巍
        /// 创建日期：5/22/2014 4:01 pm
        /// 修改者：
        /// 修改时间：
        /// ----------------------------------------------------------------------------------------
        public decimal? packagingfee { get; set; }

        /// <summary>
        /// 地址信息
        /// </summary>
        /// <value>
        /// the address
        /// </value>
        /// 创建者：王巍
        /// 创建日期：5/22/2014 4:41 pm
        /// 修改者：
        /// 修改时间：
        /// ----------------------------------------------------------------------------------------
        public address address { get; set; }

        /// <summary>
        /// 用户信息
        /// </summary>
        /// <value>
        /// the user
        /// </value>
        /// 创建者：王巍
        /// 创建日期：5/22/2014 4:41 pm
        /// 修改者：
        /// 修改时间：
        /// ----------------------------------------------------------------------------------------
        public user user { get; set; }

        /// <summary>
        /// 支付信息
        /// </summary>
        /// <value>
        /// the pay
        /// </value>
        /// 创建者：王巍
        /// 创建日期：5/22/2014 4:41 pm
        /// 修改者：
        /// 修改时间：
        /// ----------------------------------------------------------------------------------------
        public pay pay { get; set; }

        /// <summary>
        /// 菜品信息
        /// </summary>
        /// <value>
        /// the detail
        /// </value>
        /// 创建者：王巍
        /// 创建日期：5/22/2014 4:41 pm
        /// 修改者：
        /// 修改时间：
        /// ----------------------------------------------------------------------------------------
        public List<detail> detail { get; set; }
    }
}
