namespace Ets.SingleApi.Model.ExternalServices
{
    /// <summary>
    /// 类名称：UserInfo
    /// 命名空间：Ets.SingleApi.Model.ExternalServices
    /// 类功能：用户信息
    /// </summary>
    /// 创建者：王巍
    /// 创建日期：5/22/2014 4:01 PM
    /// 修改者：
    /// 修改时间：
    /// ----------------------------------------------------------------------------------------
    public class user
    {
        /// <summary>
        /// 用户手机号
        /// </summary>
        /// <value>
        /// the mobel
        /// </value>
        /// 创建者：王巍
        /// 创建日期：5/22/2014 4:01 pm
        /// 修改者：
        /// 修改时间：
        /// ----------------------------------------------------------------------------------------
        public string mobel { get; set; }

        /// <summary>
        /// 用户邮箱
        /// </summary>
        /// <value>
        /// the email
        /// </value>
        /// 创建者：王巍
        /// 创建日期：5/22/2014 4:01 pm
        /// 修改者：
        /// 修改时间：
        /// ----------------------------------------------------------------------------------------
        public string email { get; set; }

        /// <summary>
        /// 来源
        /// </summary>
        /// <value>
        /// the source
        /// </value>
        /// 创建者：王巍
        /// 创建日期：5/22/2014 4:00 pm
        /// 修改者：
        /// 修改时间：
        /// ----------------------------------------------------------------------------------------
        public string source { get; set; }

        /// <summary>
        /// 路径
        /// </summary>
        /// <value>
        /// the path
        /// </value>
        /// 创建者：王巍
        /// 创建日期：5/22/2014 4:00 pm
        /// 修改者：
        /// 修改时间：
        /// ----------------------------------------------------------------------------------------
        public string path { get; set; }

        /// <summary>
        /// 用户名
        /// </summary>
        /// <value>
        /// the username
        /// </value>
        /// 创建者：王巍
        /// 创建日期：5/22/2014 4:00 pm
        /// 修改者：
        /// 修改时间：
        /// ----------------------------------------------------------------------------------------
        public string username { get; set; }

        /// <summary>
        /// 用户密码
        /// </summary>
        /// <value>
        /// the password
        /// </value>
        /// 创建者：王巍
        /// 创建日期：5/22/2014 4:00 pm
        /// 修改者：
        /// 修改时间：
        /// ----------------------------------------------------------------------------------------
        public string password { get; set; }

        /// <summary>
        /// 用户级别
        /// </summary>
        /// <value>
        /// the levelid
        /// </value>
        /// 创建者：王巍
        /// 创建日期：5/22/2014 4:00 pm
        /// 修改者：
        /// 修改时间：
        /// ----------------------------------------------------------------------------------------
        public int levelid { get; set; }
    }
}
